#+TODO: TODO(t@) BLOCK(b@) | DONE(d!)
#+STARTUP: indent logdone logdrawer content lognoteclock-out
# ------------------------------------------------------
#+TITLE: Project Planning: tree_sitter_noir
#+LANGUAGE: en

** Development
:LOGBOOK:
CLOCK: [2026-02-18 Wed 18:52]--[2026-02-18 Wed 21:25] =>  2:33
- - Review parser.rs, associated TODO notes.
  - Start updating (very basic so far) noir_grammar.org; will mark all subsequent items therein for update afterwards.
  - Workflow to nicely view diffs for grammar changes.
CLOCK: [2026-02-16 Mon 18:11]--[2026-02-16 Mon 20:13] =>  2:02
- - Start reviewing grammar changes.
  - Refamiliarise with noir_grammar.org.
  - Git commands to get tags between prior release and current.
  - Git commands to review difference betwern frontend parser files.
:END:

*** DONE Update tree-sitter 0.25.8 to 0.26.5
CLOSED: [2026-02-16 Mon 17:26]
:LOGBOOK:
CLOCK: [2026-02-16 Mon 17:11]--[2026-02-16 Mon 17:54] =>  0:43
- No action taken to change anything in the grammar itself, just updated the tree-sitter version in the project and re-built and re-ran all tests (which pass). Incremental improvements from the latest tree-sitter features should be done separately later.
CLOCK: [2026-02-13 Fri 20:28]--[2026-02-13 Fri 21:21] =>  0:53
- Read all changelog items from 0.25.8 to 0.26.5 and made note of (probably) important ones.
CLOCK: [2026-02-10 Tue 21:25]--[2026-02-10 Tue 21:50] =>  0:25
:END:

- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.25.9
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.25.10
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.26.1
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.26.2
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.26.3
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.26.4
- https://github.com/tree-sitter/tree-sitter/releases/tag/v0.26.5

